// ============================================ Урок I ====================================================

// Заголовок
let lessonHeader = 'Домашняя работа по итогам урока 1';
console.log(lessonHeader)
// Данные
let myName = 'Егений';
let myAge = 46;
let myFamilyStatus = true;
// Вывод данных
console.log(`Имя: ${myName}. Возраст: ${myAge}. Семейное положение: ${myFamilyStatus}`);
// Типы переменных для вывода одной строкой получилось сделать только так:
console.log(`Имя первой переменной 'MY_NAME', Имя второй переменной 'MY_AGE', Имя третьей переменной 'FAMILY_STATUS'.` + ' Тип первой переменной' + ' ' + typeof(myName) + '.' + ' Тип второй переменной' + ' ' + typeof(myAge) + '.' + ' Тип третьей переменной' + ' ' + typeof(myFamilyStatus) +'.');
// Типы переменных на разных строках
console.log(`Имя первой переменной 'MY_NAME', Тип переменной:` + ' ' + typeof(myName));
console.log(`Имя первой переменной 'MY_AGE', Тип переменной:` + ' ' + typeof(myAge));
console.log(`Имя первой переменной 'FAMILY_STATUS', Тип переменной:` + ' ' + typeof(myFamilyStatus));

// ============================================= Урок II ==================================================


