console.log('Домашнее задание к уроку 10,6');
// =========================================================================================
console.log('Создаем объект дни недели:');
// =================================== OBJECT ============================================
let daysOfWeek = {
    1: 'Понедельник',
    2: 'Вторник',
    3: 'Среда',
    4: 'Четверг',
    5: 'Пятница',
    6: 'Суббота',
    7: 'Воскресенье',
}
console.log(daysOfWeek);
console.log('Выводим в консоль - "Пятница":')
console.log(daysOfWeek[5]); // выводим в консоль "Пятница"

console.log('Дни недели с удаленным днем - "Четверг":')
delete daysOfWeek[4];  // удаляем из объекта "Четверг"
console.log(daysOfWeek);

//  =================================== MAP ======================================

console.log('Создаем объект дни недели:');

let days = new Map;

days.set(1, 'Понедельник.');
days.set(2, 'Вторник.');
days.set(3, 'Среда.');
days.set(4, 'Четверг.');
days.set(5, 'Пятница.');
days.set(6, 'Суббота.');
days.set(7, 'Воскресенье.');

console.log(days)
console.log('Выводим в консоль - "Пятница":')
console.log(days.get(5)); // выводим в консоль "Пятница"
// Перебор массива
console.log('Перебор массива')
for (let day of days) {
    console.log(day)
}

console.log('Дни недели с удаленным днем - "Четверг":')
console.log(days.delete(4));  // удаляем из объекта "Четверг"

console.log(days)




